In [1]:
import pandas as pd
import numpy as  np

In [3]:
df = pd.read_excel('Train_data.xlsx')

In [4]:
df

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302
...,...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,9/04/2019,Kolkata,Banglore,CCU → BLR,19:55,22:25,2h 30m,non-stop,No info,4107
10679,Air India,27/04/2019,Kolkata,Banglore,CCU → BLR,20:45,23:20,2h 35m,non-stop,No info,4145
10680,Jet Airways,27/04/2019,Banglore,Delhi,BLR → DEL,08:20,11:20,3h,non-stop,No info,7229
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,No info,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,No info,11753

In [5]:
data.shape

(10683, 11)

In [6]:
data.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [9]:
df.Airline.value_counts()

Jet Airways                          3849
IndiGo                               2053
Air India                            1752
Multiple carriers                    1196
SpiceJet                              818
Vistara                               479
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: Airline, dtype: int64

In [10]:
df.Source.value_counts()

Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: Source, dtype: int64

In [11]:
df.Destination.value_counts()

Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: Destination, dtype: int64

In [12]:
df.Destination.value_counts()

Cochin       4537
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: Destination, dtype: int64

In [14]:
df.Additional_Info.value_counts()

No info                         8345
In-flight meal not included     1982
No check-in baggage included     320
1 Long layover                    19
Change airports                    7
Business class                     4
No Info                            3
1 Short layover                    1
Red-eye flight                     1
2 Long layover                     1
Name: Additional_Info, dtype: int64

In [23]:
df1  = data.copy()
df1.drop(['Route','Dep_Time','Arrival_Time','Additional_Info'],axis=1,inplace=True)
df1.head()

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,2h 50m,non-stop,3897
1,Air India,1/05/2019,Kolkata,Banglore,7h 25m,2 stops,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,19h,2 stops,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,5h 25m,1 stop,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,4h 45m,1 stop,13302

In [24]:
df1.isna().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Duration           0
Total_Stops        1
Price              0
dtype: int64

In [31]:
df.Duration.value_counts()

2h 50m     550
1h 30m     386
2h 45m     337
2h 55m     337
2h 35m     329
          ...
31h 30m      1
30h 25m      1
42h 5m       1
4h 10m       1
47h 40m      1
Name: Duration, Length: 368, dtype: int64

In [25]:
df1.dropna(inplace=True)
df1.isna().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Duration           0
Total_Stops        0
Price              0
dtype: int64

In [27]:
df2 = df1.copy()
df2['Destination'] = df2.Destination.apply(lambda x:'Delhi' if x == 'New Delhi' else x)

In [29]:
def con(x):
    try:
        return int(x.split(' ')[0])
    except:
        return 0

In [30]:
df3 = df2.copy()
df3['Total_Stops']=df3['Total_Stops'].apply(lambda x: con(x))
df3.Total_Stops.value_counts()

1    5625
0    3491
2    1520
3      45
4       1
Name: Total_Stops, dtype: int64

In [50]:
def con1(x):
    time = 0 
    for i in x.split(' '):
        if i[(len(i)-1)]=='h' or i[len(i)-1] == 'H':
            time = time+(int(i[:len(i)-1]))/24
        elif i[len(i)-1]=='m' or i[len(i)-1]=='M':
            time = time+(int(i[:len(i)-1])/1440)
        else:
            return x
    return float("{:.2f}".format(time))

In [52]:
#Converting the total duration to day


df3['Duration'] = df3['Duration'].apply(lambda x: con1(x))
df3.head()

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Price
0,IndiGo,24/03/2019,Banglore,Delhi,0.12,0,3897
1,Air India,1/05/2019,Kolkata,Banglore,0.31,2,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,0.79,2,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,0.23,1,6218
4,IndiGo,01/03/2019,Banglore,Delhi,0.20,1,13302

In [54]:
def con2(x):
    if(x.split('/')[0]==x):
        return False
    else:
        return True

In [59]:
df3[~df3.Date_of_Journey.apply(con2)].head()

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Duration, Total_Stops, Price]
Index: []

In [60]:
df4 = df3.copy()
df4['Day'] = df3['Date_of_Journey'].apply(lambda x: int(x.split('/')[0]))
df4['month'] = df3['Date_of_Journey'].apply(lambda x: int(x.split('/')[1]))

In [62]:
df4['Date_of_Journey'] = pd.to_datetime(df4['Date_of_Journey'])

/tmp/ipykernel_10266/3154748503.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df4['Date_of_Journey'] = pd.to_datetime(df4['Date_of_Journey'])

In [63]:
df4['year'] = df4['Date_of_Journey'].dt.year

In [64]:
df4

,Airline,Date_of_Journey,Source,Destination,Duration,Total_Stops,Price,Day,month,year
0,IndiGo,2019-03-24,Banglore,Delhi,0.12,0,3897,24,3,2019
1,Air India,2019-01-05,Kolkata,Banglore,0.31,2,7662,1,5,2019
2,Jet Airways,2019-09-06,Delhi,Cochin,0.79,2,13882,9,6,2019
3,IndiGo,2019-12-05,Kolkata,Banglore,0.23,1,6218,12,5,2019
4,IndiGo,2019-01-03,Banglore,Delhi,0.20,1,13302,1,3,2019
...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,2019-09-04,Kolkata,Banglore,0.10,0,4107,9,4,2019
10679,Air India,2019-04-27,Kolkata,Banglore,0.11,0,4145,27,4,2019
10680,Jet Airways,2019-04-27,Banglore,Delhi,0.12,0,7229,27,4,2019
10681,Vistara,2019-01-03,Banglore,Delhi,0.11,0,12648,1,3,2019
10682,Air India,2019-09-05,Delhi,Cochin,0.35,2,11753,9,5,2019